<a href="https://colab.research.google.com/github/MariyaJosep/Data-Science-Statistics-Numpy-Pandas/blob/main/Data_Science_Pandas_manipulation_workouts.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
#creating dictionay
emp_dict = {
    'eno':[100, 200, 300, 400, 500],
    'ename':['kumar', 'abcd', 'xyz', 'rahul', 'ram'],
    'salary':[24000, 20000, 15000, 30000, 20000],
    'did':[1,1,2,3,3]
    
}

emp_df = pd.DataFrame(emp_dict)

In [ ]:
emp_df.head()

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#how to access ename and salary without loc/iloc
emp_df[['ename', 'salary']]

   ename  salary
0  kumar   24000
1   abcd   20000
2    xyz   15000
3  rahul   30000
4    ram   20000

In [ ]:
emp_df.loc[[1,3],['ename', 'salary']] #index names

   ename  salary
1   abcd   20000
3  rahul   30000

In [ ]:
emp_df.iloc[[1,3],[1, 2]] #index numbers

   ename  salary
1   abcd   20000
3  rahul   30000

In [ ]:
emp_df['eno']>200

0    False
1    False
2     True
3     True
4     True
Name: eno, dtype: bool

In [ ]:
#retriving rows based on condition
emp_df[emp_df['eno']>200]

   eno  ename  salary  did
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#retriving rows based on condition using where()
emp_df.where(emp_df['eno']<200)

     eno  ename   salary  did
0  100.0  kumar  24000.0  1.0
1    NaN    NaN      NaN  NaN
2    NaN    NaN      NaN  NaN
3    NaN    NaN      NaN  NaN
4    NaN    NaN      NaN  NaN

In [ ]:
#retriving rows based on condition using where()
emp_df.where(emp_df['ename']=='abcd')

     eno ename   salary  did
0    NaN   NaN      NaN  NaN
1  200.0  abcd  20000.0  1.0
2    NaN   NaN      NaN  NaN
3    NaN   NaN      NaN  NaN
4    NaN   NaN      NaN  NaN

In [ ]:
import numpy as np

In [ ]:
#retriving rows based on multiple condition

emp_df.loc[np.where((emp_df['eno']>200) & (emp_df['salary']>20000))]

   eno  ename  salary  did
3  400  rahul   30000    3

In [ ]:
#retriving rows based on multiple condition like a sql statement

emp_df.query('eno>300 and salary>20000')

   eno  ename  salary  did
3  400  rahul   30000    3

In [ ]:
emp_df.query('eno>300 or salary>20000')

   eno  ename  salary  did
0  100  kumar   24000    1
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#retrive all rows where ename is 'abcd'
emp_df.query('ename=="abcd"')

   eno ename  salary  did
1  200  abcd   20000    1

In [ ]:
#retrive all rows where ename contains 'm'
emp_df.query('ename.str.contains("m")')

   eno  ename  salary  did
0  100  kumar   24000    1
4  500    ram   20000    3

In [ ]:
#retrive all rows where emp working in department 1 or 3
emp_df.query('did in [1, 3]')

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#retrive all rows where emp working in department 1 or 3
emp_df.query('did in [1, 3]').sort_values(by='salary')

   eno  ename  salary  did
1  200   abcd   20000    1
4  500    ram   20000    3
0  100  kumar   24000    1
3  400  rahul   30000    3

In [ ]:
#retrive all rows where emp not working in department 1 or 3
emp_df.query('did not in [1, 3]')

   eno ename  salary  did
2  300   xyz   15000    2

In [ ]:
#reading data from csv to dataframe

emp_ds = pd.read_csv('data/employee.csv')

In [ ]:
emp_ds.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20

In [ ]:
emp_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     50 non-null     int64
 1   FIRST_NAME      50 non-null     object
 2   LAST_NAME       50 non-null     object
 3   EMAIL           50 non-null     object
 4   PHONE_NUMBER    50 non-null     object
 5   HIRE_DATE       50 non-null     object
 6   JOB_ID          50 non-null     object
 7   SALARY          50 non-null     int64
 8   COMMISSION_PCT  50 non-null     object
 9   MANAGER_ID      50 non-null     object
 10  DEPARTMENT_ID   50 non-null     int64
dtypes: int64(3), object(8)
memory usage: 4.4+ KB

In [ ]:
#retrive all employees working in 50  department
emp_ds_d50 = emp_ds.query('DEPARTMENT_ID==50')

#emp_ds_d50.head(10)
#emp_ds_d50['DEPARTMENT_ID']

In [ ]:
emp_ds.head(7)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20
5,203,Susan,Mavris,SMAVRIS,515.123.7777,07-JUN-02,HR_REP,6500,-,101,40
6,204,Hermann,Baer,HBAER,515.123.8888,07-JUN-02,PR_REP,10000,-,101,70

In [ ]:
emp_ds1 = pd.read_csv('data/employee.csv', skiprows=5)

emp_ds1.head()

,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20
0,203,Susan,Mavris,SMAVRIS,515.123.7777,07-JUN-02,HR_REP,6500,-,101,40
1,204,Hermann,Baer,HBAER,515.123.8888,07-JUN-02,PR_REP,10000,-,101,70
2,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-JUN-02,AC_MGR,12008,-,101,110
3,206,William,Gietz,WGIETZ,515.123.8181,07-JUN-02,AC_ACCOUNT,8300,-,205,110
4,100,Steven,King,SKING,515.123.4567,17-JUN-03,AD_PRES,24000,-,-,90

In [ ]:
emp_ds2 = pd.read_csv('data/employee.csv', skiprows=5, header=None)

emp_ds2.head()

,0,1,2,3,4,5,6,7,8,9,10
0,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20
1,203,Susan,Mavris,SMAVRIS,515.123.7777,07-JUN-02,HR_REP,6500,-,101,40
2,204,Hermann,Baer,HBAER,515.123.8888,07-JUN-02,PR_REP,10000,-,101,70
3,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-JUN-02,AC_MGR,12008,-,101,110
4,206,William,Gietz,WGIETZ,515.123.8181,07-JUN-02,AC_ACCOUNT,8300,-,205,110

In [ ]:
column_names = ['eno', 'fname', 'c3', 'c4', 'c5', 'c6', 'c7', 'c8', 'c9', 'c10', 'c11']
emp_ds3 = pd.read_csv('data/employee.csv', skiprows=5, header=None, names=column_names)

emp_ds3.head()

,eno,fname,c3,c4,c5,c6,c7,c8,c9,c10,c11
0,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20
1,203,Susan,Mavris,SMAVRIS,515.123.7777,07-JUN-02,HR_REP,6500,-,101,40
2,204,Hermann,Baer,HBAER,515.123.8888,07-JUN-02,PR_REP,10000,-,101,70
3,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-JUN-02,AC_MGR,12008,-,101,110
4,206,William,Gietz,WGIETZ,515.123.8181,07-JUN-02,AC_ACCOUNT,8300,-,205,110

In [ ]:
#writing data to the csv file

#emp_ds_d50.to_csv('emp_d50.csv')
#emp_ds_d50.to_csv('data/emp_d50.csv')

emp_ds_d50.to_csv(r'C:\Users\HP\Desktop\emp_d50.csv')

In [ ]:
#writing data to the json file
emp_ds_d50.to_json('data\emp_d50.json')

In [ ]:
#writing data to the excel file
emp_ds_d50.to_excel('data\emp_d50.xlsx')

In [ ]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)

In [ ]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\hp\anaconda3\lib\site-packages (1.0.2)

In [ ]:
#reading table infromation to the dataframe from MySQL Database

from sqlalchemy import create_engine
import pymysql

con = create_engine("mysql+pymysql://root:Staragile_123@localhost/my_db")

In [ ]:
print(con)

Engine(mysql+pymysql://root:***@localhost/my_db)

In [ ]:
product_ds = pd.read_sql('select * from product', con)

product_ds.head()

   pid           pname    price  vendor
0  100            iPad  85000.0   Apple
1  200  Samsung Galaxy  45000.0  SAMSUN
2  300      RealME h15  15000.0  RealMe
3  400       HP Laptop  45000.0      HP
4  500          iPhone  55000.0   Apple

In [ ]:
product_ds.to_csv('data/product.csv')

In [ ]:
#creating a table from dataframe

#emp_ds.head()

emp_ds = pd.read_csv('data/employee.csv')
emp_ds.to_sql('employee1', con)

50

In [ ]:
#extract department detatils from csv and load into mysql database

dept_ds = pd.read_csv('data/department.csv')
dept_ds.to_sql('department1', con)

27

In [ ]:
emp_ds.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20

In [ ]:
emp_ds.groupby('DEPARTMENT_ID').agg('sum')

               EMPLOYEE_ID  SALARY
DEPARTMENT_ID
10                     200    4400
20                     403   19000
30                     699   24900
40                     203    6500
50                    3127   85600
60                     525   28800
70                     204   10000
90                     303   58000
100                    663   51608
110                    411   20308